load-test-delivery.yml
config:
  target: "http://192.168.11.107:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Montee douce"
    - duration: 60
      arrivalRate: 10
      name: "Charge soutenue"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Inscription puis demande de livraison"
    flow:
      - function: "setPhone"
      - post:
          url: "/users"
          json:
            fullName: "TestCharge"
            phone: "{{ phone }}"
            password: "TestPass123"
      - post:
          url: "/auth/login"
          json:
            phone: "{{ phone }}"
            password: "TestPass123"
          capture:
            - json: "$.accessToken"
              as: "token"
      - post:
          url: "/delivery-requests"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            depart: "Ouagadougou centre"
            destination: "Zone du Bois"
            packageSize: "moyen"
            isFragile: false
      - get:
          url: "/delivery-requests/mine"
          headers:
            Authorization: "Bearer {{ token }}"