load-test-orders.yml
config:
  target: "http://192.168.11.107:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Montee douce"
    - duration: 60
      arrivalRate: 10
      name: "Charge soutenue"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Inscription puis commande"
    flow:
      - function: "setPhone"
      - post:
          url: "/users"
          json:
            fullName: "TestCharge"
            phone: "{{ phone }}"
            password: "TestPass123"
      - post:
          url: "/auth/login"
          json:
            phone: "{{ phone }}"
            password: "TestPass123"
          capture:
            - json: "$.accessToken"
              as: "token"
      - post:
          url: "/orders"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            publicationId: "e1aa30b1-b7ec-4537-87ae-30d7fb538127"
            quantity: 2
            paymentMethod: "cash"
            receptionMode: "livraison"
      - get:
          url: "/orders/mine"
          headers:
            Authorization: "Bearer {{ token }}"