load-test-quotes.yml
config:
  target: "http://192.168.11.107:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Montee douce"
    - duration: 60
      arrivalRate: 10
      name: "Charge soutenue"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Inscription puis demande de devis"
    flow:
      - function: "setPhone"
      - post:
          url: "/users"
          json:
            fullName: "TestCharge"
            phone: "{{ phone }}"
            password: "TestPass123"
      - post:
          url: "/auth/login"
          json:
            phone: "{{ phone }}"
            password: "TestPass123"
          capture:
            - json: "$.accessToken"
              as: "token"
      - post:
          url: "/quote-requests"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            targetType: "agence_cargo"
            details:
              originCountry: "Chine"
              destinationCountry: "Burkina"
              weightKg: 50
              merchandiseDescription: "Test de charge"
      - get:
          url: "/quote-requests/mine"
          headers:
            Authorization: "Bearer {{ token }}"